# Homebrew Brewfile for development setup
# Install with: brew bundle --file=homebrew/Brewfile

# ============================================================================
# TAPS
# ============================================================================

# ============================================================================
# PACKAGE MANAGERS & VERSION MANAGERS
# ============================================================================

# Node.js version manager
brew "nvm"

# Ruby version manager
brew "rbenv"
brew "ruby-build"

# Python version manager
brew "pyenv"
brew "pyenv-virtualenv"

# ============================================================================
# DEVELOPMENT TOOLS
# ============================================================================

# Core development
brew "git"
brew "git-lfs"
brew "gh"              # GitHub CLI
brew "curl"
brew "wget"
brew "jq"              # JSON processor
brew "yq"              # YAML processor

# Text editors
brew "vim"
brew "neovim"

# Shell and terminal
brew "zsh"
brew "zsh-completions"
brew "tmux"
brew "starship"        # Fast prompt

# ============================================================================
# MODERN CLI TOOLS
# ============================================================================

# Better versions of standard tools
brew "bat"             # Better cat
brew "lsd"             # Better ls
brew "fd"              # Better find
brew "ripgrep"         # Better grep
brew "fzf"             # Fuzzy finder
brew "htop"            # Better top
brew "ncdu"            # Better du
brew "tldr"            # Better man pages

# File and archive tools
brew "tree"
brew "dtrx"            # Universal archive extractor
brew "p7zip"

# Network tools
brew "httpie"          # Better curl
brew "aria2"           # Download manager
brew "nmap"
brew "speedtest-cli"

# ============================================================================
# DEVELOPMENT LANGUAGES & RUNTIMES
# ============================================================================

# Go
brew "go"

# Rust
brew "rust"

# Java
brew "openjdk"

# Databases
brew "postgresql"
brew "redis"
brew "sqlite"

# ============================================================================
# CONTAINERIZATION & VIRTUALIZATION
# ============================================================================

brew "docker"
brew "docker-compose"
brew "docker-buildx"

# ============================================================================
# SYSTEM UTILITIES
# ============================================================================

# System monitoring
brew "btop"            # System monitor
brew "bandwhich"       # Network monitor
brew "dust"            # Disk usage analyzer

# System tools
brew "coreutils"       # GNU core utilities
brew "findutils"       # GNU find utilities
brew "gnu-sed"         # GNU sed
brew "grep"            # GNU grep
brew "rsync"
brew "openssh"
brew "openssl"
brew "gnupg"

# ============================================================================
# MEDIA & GRAPHICS
# ============================================================================

brew "imagemagick"
brew "ffmpeg"
brew "youtube-dl"

# ============================================================================
# PRODUCTIVITY
# ============================================================================

brew "mas"             # Mac App Store CLI
brew "mackup"          # Backup application settings

# ============================================================================
# CASK APPLICATIONS
# ============================================================================

# Development IDEs & Editors
cask "visual-studio-code"
cask "sublime-text"
cask "jetbrains-toolbox"

# Terminals
cask "iterm2"
cask "warp"
cask "hyper"

# Developer Tools
cask "docker"
cask "postman"
cask "insomnia"
cask "tableplus"
cask "sequel-pro"
cask "sourcetree"
cask "github-desktop"

# Browsers
cask "google-chrome"
cask "firefox"
cask "safari-technology-preview"

# Communication
cask "slack"
cask "discord"
cask "zoom"

# Productivity
cask "notion"
cask "obsidian"
cask "alfred"
cask "raycast"
cask "rectangle"       # Window management
cask "bartender"       # Menu bar management

# System Utilities
cask "cleanmymac"
cask "the-unarchiver"
cask "appcleaner"
cask "disk-utility"

# Design Tools
cask "figma"
cask "sketch"
cask "imageoptim"

# ============================================================================
# FONTS
# ============================================================================

# Programming fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-cascadia-code"
cask "font-victor-mono"
cask "font-hack"

# System fonts
cask "font-inter"
cask "font-roboto"
cask "font-open-sans"

# ============================================================================
# OPTIONAL APPLICATIONS
# ============================================================================

# Media
# cask "vlc"
# cask "spotify"
# cask "plex"

# Cloud Storage
# cask "dropbox"
# cask "google-drive"
# cask "onedrive"

# Password Managers
# cask "1password"
# cask "bitwarden"

# Note: Uncomment applications above as needed

# ============================================================================
# MAC APP STORE APPLICATIONS
# ============================================================================

# System utilities
mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704      # Keep Mac awake
mas "CleanMyMac X", id: 1339170533    # System cleaner

# Productivity
mas "Things 3", id: 904280696         # Task manager
mas "Bear", id: 1091189122           # Note taking
mas "Markdown Editor", id: 1458220908

# Development
mas "Xcode", id: 497799835

# Note: Uncomment and add App Store IDs for apps you want to install
